MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx150f256h.h
#define _RPD10R_RPD10R_POSITION                  0x00000000
#define _RPD10R_RPD10R_MASK                      0x0000000F
#define _RPD10R_RPD10R_LENGTH                    0x00000004

#define _RPD11R_RPD11R_POSITION                  0x00000000
#define _RPD11R_RPD11R_MASK                      0x0000000F
#define _RPD11R_RPD11R_LENGTH                    0x00000004

#define _RPD12R_RPD12R_POSITION                  0x00000000
#define _RPD12R_RPD12R_MASK                      0x0000000F
#define _RPD12R_RPD12R_LENGTH                    0x00000004

#define _RPD13R_RPD13R_POSITION                  0x00000000
#define _RPD13R_RPD13R_MASK                      0x0000000F
#define _RPD13R_RPD13R_LENGTH                    0x00000004

#define _RPD14R_RPD14R_POSITION                  0x00000000
#define _RPD14R_RPD14R_MASK                      0x0000000F
#define _RPD14R_RPD14R_LENGTH                    0x00000004

#define _RPD15R_RPD15R_POSITION                  0x00000000
#define _RPD15R_RPD15R_MASK                      0x0000000F
#define _RPD15R_RPD15R_LENGTH                    0x00000004

#define _RPE0R_RPE0R_POSITION                    0x00000000
#define _RPE0R_RPE0R_MASK                        0x0000000F
#define _RPE0R_RPE0R_LENGTH                      0x00000004

#define _RPE1R_RPE1R_POSITION                    0x00000000
#define _RPE1R_RPE1R_MASK                        0x0000000F
#define _RPE1R_RPE1R_LENGTH                      0x00000004

#define _RPE2R_RPE2R_POSITION                    0x00000000
#define _RPE2R_RPE2R_MASK                        0x0000000F
#define _RPE2R_RPE2R_LENGTH                      0x00000004

#define _RPE3R_RPE3R_POSITION                    0x00000000
#define _RPE3R_RPE3R_MASK                        0x0000000F
#define _RPE3R_RPE3R_LENGTH                      0x00000004

#define _RPE4R_RPE4R_POSITION                    0x00000000
#define _RPE4R_RPE4R_MASK                        0x0000000F
#define _RPE4R_RPE4R_LENGTH                      0x00000004

#define _RPE5R_RPE5R_POSITION                    0x00000000
#define _RPE5R_RPE5R_MASK                        0x0000000F
#define _RPE5R_RPE5R_LENGTH                      0x00000004

#define _RPE6R_RPE6R_POSITION                    0x00000000
#define _RPE6R_RPE6R_MASK                        0x0000000F
#define _RPE6R_RPE6R_LENGTH                      0x00000004

#define _RPE7R_RPE7R_POSITION                    0x00000000
#define _RPE7R_RPE7R_MASK                        0x0000000F
#define _RPE7R_RPE7R_LENGTH                      0x00000004

#define _RPE8R_RPE8R_POSITION                    0x00000000
#define _RPE8R_RPE8R_MASK                        0x0000000F
#define _RPE8R_RPE8R_LENGTH                      0x00000004

#define _RPE9R_RPE9R_POSITION                    0x00000000
#define _RPE9R_RPE9R_MASK                        0x0000000F
#define _RPE9R_RPE9R_LENGTH                      0x00000004

#define _RPE10R_RPE10R_POSITION                  0x00000000
#define _RPE10R_RPE10R_MASK                      0x0000000F
#define _RPE10R_RPE10R_LENGTH                    0x00000004

#define _RPE11R_RPE11R_POSITION                  0x00000000
#define _RPE11R_RPE11R_MASK                      0x0000000F
#define _RPE11R_RPE11R_LENGTH                    0x00000004

#define _RPE12R_RPE12R_POSITION                  0x00000000
#define _RPE12R_RPE12R_MASK                      0x0000000F
#define _RPE12R_RPE12R_LENGTH                    0x00000004

#define _RPE13R_RPE13R_POSITION                  0x00000000
#define _RPE13R_RPE13R_MASK                      0x0000000F
#define _RPE13R_RPE13R_LENGTH                    0x00000004

#define _RPE14R_RPE14R_POSITION                  0x00000000
#define _RPE14R_RPE14R_MASK                      0x0000000F
#define _RPE14R_RPE14R_LENGTH                    0x00000004

#define _RPE15R_RPE15R_POSITION                  0x00000000
#define _RPE15R_RPE15R_MASK                      0x0000000F
#define _RPE15R_RPE15R_LENGTH                    0x00000004

#define _RPF0R_RPF0R_POSITION                    0x00000000
#define _RPF0R_RPF0R_MASK                        0x0000000F
#define _RPF0R_RPF0R_LENGTH                      0x00000004

#define _RPF1R_RPF1R_POSITION                    0x00000000
#define _RPF1R_RPF1R_MASK                        0x0000000F
#define _RPF1R_RPF1R_LENGTH                      0x00000004

#define _RPF2R_RPF2R_POSITION                    0x00000000
#define _RPF2R_RPF2R_MASK                        0x0000000F
#define _RPF2R_RPF2R_LENGTH                      0x00000004

#define _RPF3R_RPF3R_POSITION                    0x00000000
#define _RPF3R_RPF3R_MASK                        0x0000000F
#define _RPF3R_RPF3R_LENGTH                      0x00000004

#define _RPF4R_RPF4R_POSITION                    0x00000000
#define _RPF4R_RPF4R_MASK                        0x0000000F
#define _RPF4R_RPF4R_LENGTH                      0x00000004

#define _RPF5R_RPF5R_POSITION                    0x00000000
#define _RPF5R_RPF5R_MASK                        0x0000000F
#define _RPF5R_RPF5R_LENGTH                      0x00000004

#define _RPF6R_RPF6R_POSITION                    0x00000000
#define _RPF6R_RPF6R_MASK                        0x0000000F
#define _RPF6R_RPF6R_LENGTH                      0x00000004

#define _RPF7R_RPF7R_POSITION                    0x00000000
#define _RPF7R_RPF7R_MASK                        0x0000000F
#define _RPF7R_RPF7R_LENGTH                      0x00000004

#define _RPF8R_RPF8R_POSITION                    0x00000000
#define _RPF8R_RPF8R_MASK                        0x0000000F
#define _RPF8R_RPF8R_LENGTH                      0x00000004

#define _RPF9R_RPF9R_POSITION                    0x00000000
#define _RPF9R_RPF9R_MASK                        0x0000000F
#define _RPF9R_RPF9R_LENGTH                      0x00000004

#define _RPF10R_RPF10R_POSITION                  0x00000000
#define _RPF10R_RPF10R_MASK                      0x0000000F
#define _RPF10R_RPF10R_LENGTH                    0x00000004

#define _RPF11R_RPF11R_POSITION                  0x00000000
#define _RPF11R_RPF11R_MASK                      0x0000000F
#define _RPF11R_RPF11R_LENGTH                    0x00000004

#define _RPF12R_RPF12R_POSITION                  0x00000000
#define _RPF12R_RPF12R_MASK                      0x0000000F
#define _RPF12R_RPF12R_LENGTH                    0x00000004

#define _RPF13R_RPF13R_POSITION                  0x00000000
#define _RPF13R_RPF13R_MASK                      0x0000000F
#define _RPF13R_RPF13R_LENGTH                    0x00000004

#define _RPF14R_RPF14R_POSITION                  0x00000000
#define _RPF14R_RPF14R_MASK                      0x0000000F
#define _RPF14R_RPF14R_LENGTH                    0x00000004

#define _RPF15R_RPF15R_POSITION                  0x00000000
#define _RPF15R_RPF15R_MASK                      0x0000000F
#define _RPF15R_RPF15R_LENGTH                    0x00000004

#define _RPG0R_RPG0R_POSITION                    0x00000000
#define _RPG0R_RPG0R_MASK                        0x0000000F
#define _RPG0R_RPG0R_LENGTH                      0x00000004

#define _RPG1R_RPG1R_POSITION                    0x00000000
#define _RPG1R_RPG1R_MASK                        0x0000000F
#define _RPG1R_RPG1R_LENGTH                      0x00000004

#define _RPG2R_RPG2R_POSITION                    0x00000000
#define _RPG2R_RPG2R_MASK                        0x0000000F
#define _RPG2R_RPG2R_LENGTH                      0x00000004

#define _RPG3R_RPG3R_POSITION                    0x00000000
#define _RPG3R_RPG3R_MASK                        0x0000000F
#define _RPG3R_RPG3R_LENGTH                      0x00000004

#define _RPG4R_RPG4R_POSITION                    0x00000000
#define _RPG4R_RPG4R_MASK                        0x0000000F
#define _RPG4R_RPG4R_LENGTH                      0x00000004

#define _RPG5R_RPG5R_POSITION                    0x00000000
#define _RPG5R_RPG5R_MASK                        0x0000000F
#define _RPG5R_RPG5R_LENGTH                      0x00000004

